lab11_php_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
public function admin()
{
    $title = 'Daftar Artikel';
    $artikels = $this->artikel->findAll();

INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Kerja Dek', 'dengan tidur tidak membuatmu langsung kaya dek', 'kerja-dek')
---
public function store()
{
    if (!$this->validate([
        'judul' => [
            'rules' => 'required',
            'errors' => [
                'required' => 'Judulnya wajib diisi'
            ],
        ],
        'isi' => [
            'rules' => 'min_length[10]',
            'errors' => [
                'min_length' => 'Minimal 10 karakter'
            ]
        ]
    ])) {
        session()->setFlashdata('errors', $this->validator->listErrors());
        redirect()->back()->withInput();
    }

    // var_dump($this->request->getPost()); die();

    $this->artikel->insert([
        'judul' => ucwords(strtolower($this->request->getPost('judul'))),
        'isi' => $this->request->getPost('isi'),
        'slug' => url_title(strtolower($this->request->getPost('judul'))),

    ]);

SELECT *
FROM `artikel`
WHERE `slug` = 'kerja-dek'
 LIMIT 1
---
public function edit($slug)
{
    $data =[
        'title' => 'Edit Artikel',
        'artikel' => $this->artikel->where('slug', $slug)->first()

UPDATE `artikel` SET `judul` = 'Senja', `isi` = 'dengan secangkir kopi kita bisa menikmati matahari terbenam', `slug` = 'senja'
WHERE `artikel`.`id` IN ('3')
---
public function update($id)
{
    if (!$this->validate([
        'judul' => [
            'rules' => 'required',
            'errors' => [
                'required' => 'Judulnya diisi dong sayang'
            ],
        ],
        'isi' => [
            'rules' => 'min_length[10]',
            'errors' => [
                'min_length' => 'Isi konten 10 karakter aja kok, yok bisa yok'
            ]
        ]
    ])) {
        session()->setFlashdata('errors', $this->validator->listErrors());
        return redirect()->back();
    }

    $this->artikel->update($id, [
        'judul' => ucwords(strtolower($this->request->getPost('judul'))),
        'isi' => $this->request->getPost('isi'),
        'slug' => url_title(strtolower($this->request->getPost('judul')))
    ]);

SELECT *
FROM `artikel`
WHERE `slug` = 'senja'
 LIMIT 1
DELETE FROM `artikel`
WHERE `slug` = 'senja'
---
public function delete($slug)
{
    if($this->artikel->where('slug', $slug)->first() === NULL) {
        throw PageNotFoundException::forPageNotFound('Data tidak ditemukan!');
    }

    $this->artikel->where('slug', $slug)->delete();